       01  WKR-ENTRADA.
           05  ENT-OPERACAO     PIC X(10).
           05  ENT-CODIGO       PIC X(06).
           05  ENT-NOME         PIC X(30).
           05  ENT-EMAIL        PIC X(60).
           05  ENT-TELEFONE     PIC X(11).
