       01  DADOS-CLIENTE.
           05  CLI-OPERACAO          PIC X(10).
           05  CLI-CODIGO            PIC X(06).
           05  CLI-NOME              PIC X(30).
           05  CLI-EMAIL             PIC X(60).
           05  CLI-TELEFONE          PIC X(11).
           05  CLI-RETORNO           PIC X(04).
           05  CLI-MENSAGEM          PIC X(60).